import random
from telethon import events
import asyncio
from JoKeRUB import l313l
from ..core.managers import edit_or_reply

plugin_category = "extra"
ملحة = [1510396227, 6048901890]  
banned_users = []  # تأكد من تعريف قائمة المستخدمين المحظورين بشكل مناسب

@l313l.ar_cmd(incoming=True, func=lambda e: "السلام عليكم" in e.text.lower() or "سلام عليكم" in e.text.lower(), edited=False)
async def reply_salam(event):
    # تحقق إذا كان المرسل محظورًا
    if event.sender.id in banned_users:
        # إذا كان محظورًا، الرد على المستخدم
        await event.reply("ههههه هاي بسبب الملحة")  
        await event.reply("😂")  
        return  # إيقاف تنفيذ الدالة بعد الرد

    # إذا لم يكن محظورًا، الرد بالسلام
    username = event.sender.username if event.sender.username else "لا يوجد اسم مستخدم"
    await event.reply(f"عليكم السلام اهلا {event.sender.first_name}")

@l313l.ar_cmd(
    pattern="اوامر الحظر$",
    command=("اوامر الحظر ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الحـظر \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n( `.حظر` ) \n-  تقوم بالرد على شخص او وضع معرفه مع الامر وسيحظره من المجموعة\n\n( `.الغاء حظر` )\n - بالرد على الشخص او كتابة معرفه مع الامر لالغاء حظره\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n⌔︙CH : @jepthon "
           )
      
@l313l.ar_cmd(
    pattern="اوامر الكتم$",
    command=("اوامر الكتم ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الكـتم \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n( `.كتم` ) \n-  تقوم بالرد على شخص او وضع معرفه مع الامر وسيكتمه من المجموعة\n\n( `.الغاء كتم` )\n - بالرد على الشخص او كتابة معرفه مع الامر لالغاء كتمه\n\n( `.كتم_مؤقت+عدد الساعات او الدقائق+السبب` )\n - بالرد على الشخص او كتابة معرفه مع الامر لتقيدة من المجموعة مؤقتا\n**مثال : كتم_مؤقت 1h مخالف القوانين**\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n⌔︙CH : @jepthon "
           )

@l313l.ar_cmd(
    pattern="اوامر التثبيت$",
    command=("اوامر التثبيت ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر التثبيت \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n( `.تثبيت` ) \n-  تقوم بالرد على الرسالة مع الامر وستثبت في المجموعة\n\n( `.الغاء التثبيت` )\n - بالرد على الرسالة مع الامر لإلغاء تثبيتها\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n⌔︙CH : @jepthon "
           )

@l313l.ar_cmd(
    pattern="اوامر الاشراف$",
    command=("اوامر الاشراف", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"اوامر الاشراف \n `.لقب` , لرفع المستخدم مشرف مع صلاحية دعوة رابط ونشر القصص ولفب مخفي \n `.مشرف` , لرفع المستخدم مشرف مع كامل الصلاحيات دون الحظر \n `.مشرف2` , لرفع المستخدم مشرف مع صلاحات كاملة دون حظر واضافة مشرفين ودون صلاحية الاتصال \n `.مشرف3` لرفع العضو مشرف مع صلاحيات بسيطة جدا \n `.تنزيل الكل` , لتنزيل المشرف عضو (انزاله من الاشراف)"
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الاشراف \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n( `.رفع مشرف` ) \n-  تقوم بالرد على الشخص مع الامر و سيرفع مشرفا في المجموعة\n\n( `.تك` )\n - بالرد على الشخص مع الامر لإنزاله من الاشراف في المجموعة\n\n( `.ارفع` ) \n- لرفع المستخدم في جميع المجموعات مع كافة الصلاحيات مع لقب مخفي\n\n( `.نزل` ) \n-لتنزيل الشخص من رتبة الاشراف في جميع المجموعات\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon "
           )

@l313l.ar_cmd(
    pattern="اوامر التفليش$",
    command=("اوامر التفليش", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
       "شـرح عـن اوامـر التفليـش \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.تفليش بالطرد` ) \n ارسل  الامـر لطرد جميع الاعضاء من المجموعه \n\n- ( `.تفليش` ) \n كتابة  الامـر فقط في المجموعه لحظر جميع الاعضاء\n\n- ( `.حظر_الكل` ) \n كتابة  الامـر فقط في المجموعه لحظر جميع الاعضاء بدون صلاحيات عن طريق بوت الحماية \n\n- ( `.طرد_الكل` ) \n كتابة  الامـر فقط في المجموعه ليقوم بطرد جميع الاعضا بدون صلاحيات عن طريق بوت الحماية \n\n- ( `.كتم_الكل` ) \n كتابة  الامـر فقط في المجموعه ليقوم بكتم جميع الاعضاء بدون صلاحيات اشراف عن طريق بوت الحماية\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر المحذوفين$",
    command=("اوامر المحذوفين", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر المـحذوفين \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.حذف المحظورين` ) \n كتابة  الامـر في الكروب لالغاء حظر جميع الاعضاء \n\n- ( `.اطردني` ) \n فقـط ارسل الامر في المجموعة لمغادرة المجموعه التي تم ارسال الامر فيها\n\n- ( `.المحذوفين` ) \n لعرض الحسابات المحذوفة في مجمـوعة معيـنة ولحذفهم ارسل .المحذوفين اطردهم\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )
@l313l.ar_cmd(
    pattern="اوامر الكروب$",
    command=("اوامر الكروب", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الكروب \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.الاحداث` ) \n كتابة  الامـر في الكروب لعرض احداث الكروب\n\n- ( `.الاعضاء` ) \n فقـط ارسل الامر في المجموعة لعرض اعضاء المجموعة\n\n- ( `.المشرفين` ) \n ارسل الامر في المجموعه لعرض حسابات المشرفين\n\n- ( `.البوتات` )\n ارسل الامر في المجموعه لعرض البوتات\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الترحيب$",
    command=("اوامر الترحيب", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الترحيب \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n--( `.ترحيب + ترحيبك` )\n اكتب الامر مع ترحيب في المجموعه ليرحب بالاعضاء الجدد\n\n- ( `.حذف الترحيب` ) \n فقـط ارسل الامر في المجموعة لحذف الترحيبات\n\n- ( `.الترحيب` )\n ارسل الامر في المجموعه لعرض ترحيبات المجموعة\n\n- ( `.الترحيب السابق ايقاف/تشغيل` )\n لتعطيل اخر ترحيب وضعته في المجموعة او تشغيل\n\n- ( `.رحب + ترحيبك` )\n لوضع ترحيب في عند دخول الاعضاء للمجموعة سوف يرحب بهم في الخاص\n\n- ( `.حذف رحب` )\n لحذف الترحيب في الخاص\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الردود$",
    command=("اوامر الردود", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الـردود \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.رد + ردك` ) \n\n لوضع رد معين في المجموعة اكتب الامر وردك\n\n- ( `.حذف الردود` ) \n فقـط ارسل الامر في المجموعة لحذف الردود المضافة\n\n- ( `.الردود` ) \n ارسل الامر في المجموعه لعرض ردود المجموعة\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الحماية$",
    command=("اوامر الحماية", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الـخاص \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.الحماية تشغيل/تعطيل` ) \n لتشغيل امر الحمايه او تعطيله في الـخاص \n\n- ( `.سماح` ) \n بالرد على الشخص للسماح له بالتكلم في الخاص\n\n- ( `.رفض` ) \n بالرد على الشخص لرفضه من الخاص \n\n- ( `.المسموح لهم` )\n فقط ارسل الامر لاظهار الاشخاص المسموح لهم والمرفوضين\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر التلكراف$",
    command=("اوامر التلكراف", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر التلكراف \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.تلكراف ميديا` ) \n\n لاستخراج رابط من الصورة على شكل رابط تلكراف  \n\n- ( `.تلكراف نص` ) \n بالرد على النص او المقالة لصنع رابط تلكراف للنص\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الانتحال$",
    command=("اوامر الانتحال", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الانتحال \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.انتحال` ) \n\n بالرد على الشخص لنسخ حسابه بالكامل من صورة واسم وبايو  \n\n- ( `.اعادة` ) \n لارجاع الحساب الى وضعه الطبيعي لما كان سابقا\n\n- ( `.انتحال_الدردشه` ) \n قم بكتابة الامر مع معرف المجموعة او القناة بدون @\n\n- ( `.اعادة_الدردشه` ) \n لارجاع الدردشه الى وضعه الطبيعي لما كان سابقا\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر التقليد$",
    command=("اوامر التقليد", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الـتقليـد \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.تقليد` ) \n بالرد على الشخص لتقليد جميع رسائله في الدردشه \n\n- ( `.الغاء التقليد` ) \n بالرد على الشخص لايقاف التقليد\n\n- ( `.المقلدهم` ) \nلاظهـار قائمه الاشخاص الذي فعـلت عليهم امر التقليد ولمسحهم ارسل  (`.مسح المقلدهم`) \n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر المنشن$",
    command=("اوامر المنشن", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الـمنشن \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- (`.منشن + المسج`)\nقم بكتابة الامر في المجموعة لعمل تاك مفرد للاعظاء الموجودين\n- (`.الغاء منشن`)\nلألغاء التاك \n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر التحميل$",
    command=("اوامر التحميل", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن امـر التحمـيل\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر\n\n- (`.بحث + اسم الاغنية`)\nبكتابة اسم الاغنية مع الامر لارسال الاغنيه مباشرا واذا ما اشتغل جرب اوامر التحميل الاخرى\n- مثـال : `.بحث ماهر زين`\n\n- (`.يوت + اسم الفيديو او الاغنية`)\nكتابة الامر مع اسم الفيديو او الاغنية ليعطيك نتائج البحث وروابط من يوتيوب تستخدم مع اوامر التحميل\n- مثـال : `.يوت ماهر زين`\n\n- (`.تحميل ص + رابط الاغنية`)\nلتحميل اغنيه من خلال وضع الرابط مع الامر\n- مثـال : `.تحميل ص https://youtube.com/...`\n\n- (`.فيديو + اسم الاغنية`)\nكتابة الامر مع اسم المقطع لتحميله وارساله\n- مثـال : `.فيديو باسم الكربلائي`\n\n- (`.انستا + الرابط `)\nيستخدم هذا الامر لتحميل من الانستا فقط اكتب الامر مع رابط الفيديو ليحمله\n- مثـال : `.انستا https://instagram.com/jdisjejjd...`\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الترجمة$",
    command=("اوامر الترجمة", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الترجمة \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.ترجمة ar` ) \n\n بالرد على النص لترجمته للغه  ية\n\n- ( `.ترجمة en` ) \n بالرد على النص لترجمته للغه الانكليزية\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر النطق$",
    command=("اوامر النطق", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الـنطق \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.تكلم ar` ) \n بالرد على النص لتحويله الى مقطع صوتي للغة  يه \n\n- ( `.تكلم en` ) \n بالرد على النص لتحوليه الى مقطع صوتي للغه الانكليزية\n\n- ( `.احجي ar` ) \n بالرد على مقطع صوتي او بصمة لتحوليه الى نص للغه  ية\n\n- ( `.احجي en` ) \n بالرد على مقطع صوتي او بصمة لتحوليه الى نص للغه الانكليزية\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر القفل$",
    command=("اوامر القفل", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر القـفـل \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.قفل + الاضافة` ) \n تكتب الامر مع الاضافة لقفل شي معين في المجموعة \n\nالاضافات  : \n - الدردشه  : لقفل ارسال الرسائل \n- الوسائط   : لقفل ارسال الوسائط\n - الملصقات  : لقفل ارسال الملصقات\n- الروابط  : لقفل ارسال الروابط\n- المتحركه  : لقفل ارسال المتحركه\n- الالعاب  : لقفل ارسال الالعاب الانلاين\n- الانلاين  : لقفل ارسال البوتات الانلاين\n- التصويت  : لقفل ارسال التوصيتات \n- الكل :  لقفل ارسال كل شي\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الفتح$",
    command=("اوامر الفتح", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الفـتـح \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.فتح + الاضافة` ) \n تكتب الامر مع الاضافة لفتـح شي معين في المجموعة \n\nالاضافات  : \n - الدردشه  : لفتح ارسال الرسائل \n- الوسائط   : لفتح ارسال الوسائط\n - الملصقات  : لفتح ارسال الملصقات\n- الروابط  : لفتح ارسال الروابط\n- المتحركه  : لفتح ارسال المتحركه\n- الالعاب  : لفتح ارسال الالعاب الانلاين\n- الانلاين  : لفتح ارسال البوتات الانلاين\n- التصويت  : لفتح ارسال التوصيتات \n- الكل :  لفتح ارسال كل شي\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر المنع$",
    command=("اوامر المنع", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الـمنـع \n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر \n\n- ( `.منع + الكلمة` ) \n لمـنع الـكلمة في الـدردشة وسيتم حذفها عند ارسالها من اي شخص \n\n- ( `.الغاء منع + الكلمة` ) \n لالغاء منع الكلمة والسماح للجميع بأرسالها في الدردشة\n\n- ( `.قائمة المنع` ) \nلاظهـار قائمه الكـلمات الـتي منعـتها في الـدردشـه \n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
           )
@l313l.ar_cmd(
    pattern="تسلية 1$",
    command=("تسلية 1", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر التسـلية 1 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.غبي` )\n- ( `.القنابل` )\n- ( `.اتصل` )\n- ( `.قتل` )\n- ( `.شنو` )\n- ( `.طوبة` )\n- ( `.مربعات` )\n- ( `.حلويات` )\n- ( `.نار` )\n- ( `.شحن` )\n\nتحذيـر : لا تكثر من استخدام هذه الاوامر لانها قد تسبب ضغط على حسابك او تعليقه من ارسال الرسائل لفترة وجيزة.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 2$",
    command=("تسلية 2", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر التسـلية 2 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.افكر` )\n- ( `.متت` )\n- ( `.ضايج` )\n- ( `.ساعه` )\n- ( `.مح` )\n- ( `.قلب` )\n- ( `.جيم` )\n- ( `.الارض` )\n- ( `.قمر` )\n- ( `.اقمار` )\n- ( `.قمور` )\n\nتحذيـر : لا تكثر من استخدام هذه الاوامر لانها قد تسبب ضغط على حسابك او تعليقه من ارسال الرسائل لفترة وجيزة.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 3$",
    command=("تسلية 3", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر التسـلية 3 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.نجمه` )\n- ( `.مكعبات` )\n- ( `.مطر` )\n- ( `.تفريغ` )\n- ( `.فليم` )\n- ( `.احبك` )\n- ( `.طائره` )\n- ( `.شرطه` )\n- ( `.النضام الشمسي` )\n\nتحذيـر : لا تكثر من استخدام هذه الاوامر لانها قد تسبب ضغط على حسابك او تعليقه من ارسال الرسائل لفترة وجيزة.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 4$",
    command=("تسلية 4", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر التسـلية 4 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.قاتل` )\n- ( `.عين` )\n- ( `.افكرر` )\n- ( `.افعى` )\n- ( `.رجل` )\n- ( `.مايكرو` )\n- ( `.فايروس` )\n- ( `.قطار` )\n- ( `.نيكول` )\n- ( `.موسيقى` )\n- ( `.رسم` )\n\nتحذيـر : لا تكثر من استخدام هذه الاوامر لانها قد تسبب ضغط على حسابك او تعليقه من ارسال الرسائل لفترة وجيزة.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 5$",
    command=("تسلية 5", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر التسـلية 5 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.تحميل` )\n- ( `.مربع` )\n- ( `.دائره` )\n- ( `.انيم` )\n- ( `.بشره` )\n- ( `.قرد` )\n- ( `.يد` )\n- ( `.العد التنازلي` )\n- ( `.قلوب` )\n\nتحذيـر : لا تكثر من استخدام هذه الاوامر لانها قد تسبب ضغط على حسابك او تعليقه من ارسال الرسائل لفترة وجيزة.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 6$",
    command=("تسلية 6", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر التسـلية 6 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.ترامب` + النص )\n- ( `.مودي` + النص )\n- ( `.بنر` + النص )\n- ( `.كانا` + النص )\n- ( `.تويت` + المعرف ; النص )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 7$",
    command=("تسلية 7", plugin_category),
               )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
         "قائمة اوامر التسـلية 7 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.تراش` بالرد على ملصق/صورة )\n- ( `.تهديد` بالرد على ملصق/صورة )\n- ( `.فخ`  بالرد على ملصق/صورة + الاسم1 ; الاسم2 )\n- ( `.بورن`  بالرد على ملصق/صورة + المعرف ; النص )\n- ( `.تويت` + المعرف ; النص )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="تسلية 8$",
    command=("تسلية 8", plugin_category),
               )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
         "قائمة اوامر التسـلية 8 :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.نص` + النص )\n- ( `.ستيكر` + النص )\n- ( `.هونك` + النص )\n- ( `.تغريد` + النص )\n- ( `.غلاكس` + النص )\n- ( `.دوغي` + النص )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n⌔︙CH : @jepthon"
           )

@l313l.ar_cmd(
    pattern="اوامر الملصقات$",
    command=("اوامر الملصقات", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الملصقـات\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر\n\n- ( `.ملصق` )\nبالرد على الملصق لأخذه و عمل حزمه خاصة بك و اضافته بها\n\n- ( `.حزمة` )\nبالرد على الملصق لنسخ الحزمة كاملة بداخل حزمة ملصقاتك الخاصة\n\n- (`.معلومات_الملصق` )\nبالرد على الملصق لعرض معلومات الحزمة\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
            )

@l313l.ar_cmd(
    pattern="اوامر التكرار$",
    command=("اوامر التكرار", plugin_category),
            )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر التـكرار\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.كرر  +عدد التكرار  +بالرد على الرسالة` )\n يقوم بتكرار النصوص والوسائط بالرد على الرسالة او الصورة \nمثال  :  ( بالرد على صورة  `.كرر 10` )\n\n- ( `.تكرار الملصق + بالرد على ملصق` )\n بالرد على الملصق ليقوم باستخراج جميع ملصقات الحزمه وارسالها\n\n- (`.مكرر  + وقت بالدقائق  + عدد  + بالرد` )\n بالرد على نص او صورة او اي شي يقوم بالتكرار  مع وقت معين .\nمثال  : بالـرد على نص ( `.مكرر 10 2` )  عندها سترسل 10 رسائل نصية ( النص الي رديت عليه ) بفاصل ثانيتين بين كل رسالة\n\n- ( `.ضع تكرار` + العدد )\nلمنع التكرار بالمجموعة الخاصة بك بالعدد الذي وضعته للعودة للوضع الطبيعي ضع 999999.\nمثال : ( `.ضع تكرار 10 )\n\n- ( `.ايقاف التكرار` )\nلأيقاف جميع التكرار ومن بينهم النشر التلقائي\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
            )

@l313l.ar_cmd(
    pattern="اوامر السبام$",
    command=("اوامر السبام", plugin_category),
            )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر السبـام\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.سبام + كلمـة` )\nيقوم بتفصيخ احرف الكلمه وارسالها جربه بنفسك\n\n- ( `.وسبام + كلـمة` )\nكتابة الامر مع نص معين يقوم بتفصيخ الجمله كلمه كلمه وارسالها\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
             )

@l313l.ar_cmd(
    pattern="اوامر التنظيف$",
    command=("اوامر التنظيف", plugin_category),
            )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر التنظيـف\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر\n\n- ( `.تنظيف + عدد الرسائل` )\nيقوم بحذف الرسائل اكتب الامر وعدد معين من الرسائل سيقوم بحذفها \n\n- ( .تنظيف  + الاضافة )\n يـجب وضع الشـارحه مع الاضافة (-)\nمثـال  :  ( `.تنظيف -ح` )  <سيقوم بحذف المتحركات في الدردشة>\nالاضافات : \n (-ب) : لحـذف الرسائل الـصوتية\n (-م): لحـذف الملفات\n (-ح): لحـذف المتحـركه\n (-ص): لحـذف الـصور\n (-غ): لحـذف الاغاني\n (-ق): لحـذف الـملصقات\n (-ر): لحـذف الـروابط \n(-ف): لحـذف الفـيديوهـات\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
          )               

@l313l.ar_cmd(
    pattern="اوامر المسح$",
    command=("اوامر المسح", plugin_category),
            )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر المسـح\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.مسح  + بالرد على النص` )\nفقط اكتب الامر بالرد على الرسالة ليقوم بحذفها \n\n- ( `.حذف رسائلي` )\nاكتب الامر في اي مكان وسيقوم بحذف جميع رسائلك في الدردشه حتى لو لم يكن لديك صلاحيات \n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
         )

@l313l.ar_cmd(
    pattern= "اوامر الوقت والتاريخ$",
    command=("اوامر الوقت والتاريخ", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الوقت والتاريخ :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.تاريخ` )\nبالرد على الشخص او كتابة معرفه مع الامر لعرض سجل اسماء حسابه.\n\n- ( `.الوقت` )\nلعرض الوقت على شكل ملصق\n\n- ( `.وقت` )\nلعرض الوقت على شكل كتابة\n\n- ( `.مؤقت` + الوقت + النص )\nيقوم بإرسال رسالة مؤقتة و حذفها بعد وقت معين\n- مثـال : `.مؤقت 5 الجوكر`\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر كورونا$",
    command=("اوامر كورونا", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر كورونا :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه الاوامر\n\n- ( `.كورونا` + الدولة )\nللحصول على احصائيات فايروس كورونا\n- مثـال : `.كورونا Morocco`\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر الصلاة$",
    command=("اوامر الصلاة", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الصلاة :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.صلاة` )\nاكتب الامر مع اسم محافظتك باللغه الانكليزية للحصول على اوقات الصلاة\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر مساعدة$",
    command=("اوامر مساعدة", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر المساعدة :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.موقع` + المكان )\nللحصول على مكان في الخريطه و ارساله لك\n\n- ( `.جد بكج + اسم البكج` )\nلمعرفة هل ان البكج او المكتبة موجود ام لا/n/n- ( `.صورة` )\nبالرد على الشخص للحصول على صورة حسابه الشخصية.\n\n- ( `.صوره كلها` )\nللرد على الشخص للحصول على صور حسابه الشخصية كلها.\n\n- ( `.سرعة النت` )\nارسل الامر لقياس سرعة الانترنت\n\n- ( `.حساب` )\nكتابة الامر مع معادلة رياضية و سيقوم بحلها و ارسالها لك\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="فارغ $",
    command=("فارغ ", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر، :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.معلومات` )\nارسل الامر في المجموعة لرؤية معلومات المجموعة او اكتب الامر مع معرف المجموعة\n\n- ( `.البوتات` )\nارسل الامر في المجموعة لرؤية البوتات الموجودة في المجموعة او اكتب الامر مع معرف المجموعة\n\n- ( `.المشرفين` )\nارسل الامر في المجموعة لرؤية مشرفين المجموعة او اكتب الامر مع معرف المجموعة\n\n- ( `.الاعضاء` )\nارسل الامر في المجموعة لرؤية اعضاء المجموعة او اكتب الامر مع معرف المجموعة\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر الروابط$",
    command=("اوامر الروابط", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الروابط :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.دنس` + الرابط )\nلكشف نظام دومين موقع معين اكتب الامر مع الرابط\n\n- ( `.مصغر` )\nبالرد على الرابط او وضع الرابط مع الامر ليقوم بتصغيره\n\n- ( `.رابط_مخفي` )\nبالرد على الرابط لاخفاء الرابط و جعله في مسافه معينة جرب الامر بنفسك\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر التحذيرات$",
    command=("اوامر التحذيرات", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر التحذيرات :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.تحذير + السبب` )\nبالرد على الشخص ليقوم بتحذيره يمكنك وضع سبب كذلك\n\n- ( `.التحذيرات` )\nبالرد على الشخص ليقوم باظهار تحذيراته.\n\n- ( `.حذف التحذيرات` )\nبالرد على الشخص لحذف تحذيراته.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر اللستة$",
    command=("اوامر اللستة", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر اللستة :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.لستة` )\nيقوم بصنع لستة شفافة لمنشور معين\nشـرح الامـر  : \n https://t.me/jepthon\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر الملكية$",
    command=("اوامر الملكية", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الملكية :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.ملكية` )\nيقوم بكتابة التمر في القناة التي تريد تحويلها لشخص و بكتابة الامر مع معرف الشخص\n\n لاستخدام امر نقل الملكية تحتاج لوضع TG_2STEP_VERIFICATION_CODE و معه رمز حسابك في الفارات \n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر السليب$",
    command=("اوامر السليب", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر السليب :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.سليب` + السبب)\nيقوم بادخالك في وضع غير المتصل يقوم بالرد على اي شخص برسالة يقول فيها انك غير متواجد.\n- مثـال : `.سليب نايم`\n\n- ( `.سليب_ميديا` + السبب )\nيقوم بنفس وظيفة الامر العادي غير انه يمكنك ارفاق صورة او متحركة بالرد عليها مع الامر.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الاسم$",
    command=("اوامر الاسم", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الاسم الوقتي :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.اسم وقتي` )\nبكتابة الامر لاضافة اسم وقتي حسب منطقة التي وضعتها .\n\n- ( `.انهاء اسم وقتي` )\nلانهاء الاسم الوقتي و ارجاع الاسم الطبيعي .\n\n- ( `.الصورة الوقتية` )\n لوضع صورة تتغير مع الوقت\n\n- ( `.انهاء الصورة الوقتية` )\n لأنهاء الصورة واسترجاع الصورة الاصلية\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر البايو$",
    command=("اوامر البايو", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر البايو الوقتي :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.بايو وقتي` )\nبكتابة الامر لاضافة بايو وقتي حسب منطقة التي وضعتها .\n\n- ( `.انهاء بايو وقتي` )\nلانهاء البايو الوقتي و ارجاع البايو الطبيعي .\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الكروب الوقتي$",
    command=("اوامر الكروب الوقتي", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الكروب الوقتي :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.كروب وقتي` )\nبكتابة الامر لاضافة كروب وقتي حسب منطقة التي وضعتها .\n- ( `.انهاء كروب وقتي` )\nلانهاء الكروب الوقتي \n- ( `.كروب صورة وقتي` )\nبكتابة الامر لتشغيل الصورة الوقتية للمجموعة حسب منطقة التي وضعتها .\n- ( `.انهاء كروب صورة وقتي` )\n لأنهاء الصورة الوقتية للمجموعة.\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر التشغيل$",
    command=("اوامر التشغيل", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر التشغيل :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.اعادة التشغيل` )\nلاعادة تشغيل البوت و ارجاعة الى شكله الطبيعي كما كان في الاول فقط ارسل الامر .\n\n- ( `.تحديث` )\nفقط ارسل الامر للتاكد اذا كان هناك تحديثات من مطورين السورس .\n\n- ( `.التحديثات تشغيل` )\nيستخدم هذا الامر لارسال رسالة تجريبية تلقائية لرؤية البوت اذا ما كان شغال بعد اعادة التشغيل او التحديث سيرس امر `.بنك` ولايقافه ارسل `.التحديثات ايقاف` .\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الاطفاء$",
    command=("اوامر الاطفاء", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الاطفاء :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.اطفاء` )\nلالغاء تشغيل البوت و يجب اعادة تشغيله من هيروكو .\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الكشف$",
    command=("اوامر الكشف", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الكشف :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.الايدي` )\nبالرد على الشخص او كتابة معرفه مع الامر لعرض معلوماته.\n\n- ( `.ايدي` )\nبالرد على الشخص لعرض معلوماته\n\n- ( `.كشف` )\nبالرد على الشخص لعرض معلوماته بشكل مبسط\n\n- ( `.رابط الحساب` )\nيالرد على الشخص للحصول على رابط حساب الشخص\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر كوكل$",
    command=("اوامر كوكل", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر كوكل :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.صور +  عدد الصور + نص` )\nللحصول على صور من متصفح كوكل بكتابة الامر وعدد الصور الحد 10 واسم النص \n\n- ( `.استخرج + عربي` ) \n لاستخراج النصوص من الصور التي تحتوي على كلمات عربيه\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الاذاعه$",
    command=("اوامر الاذاعه", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح اوامر الـتوجيه والأذاعـة :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.وجه + نص` )\nلعمـل اذاعـة للـنص في المجـموعـات اكتب الامر ونـصـك\n\n- ( `.حول + نص` )\nلعمـل اذاعـة للـنص للـ الدردشـات الخـاصة اكتب الامر ونـصـك\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)


@l313l.ar_cmd(
    pattern="امر الصورة الذاتية$",
    command=(" امر الصورة الذاتية", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شرح امر الصورة الذاتية :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.ذاتية` )\n بالـرد عـلى الصـورة ذاتيـة الـتدمير ليـقوم بـحفظها وارسالـها لك فـي الرسائل الـمحفوظة بسرية وبـدون عـلم الـطرف الأخر \n- ( `.حفظ` )\n بالـرد عـلى الصـورة الموجوده في المجموعة ذات التقييد المحتوى ليـقوم بـحفظها وارسالـها لك فـي الرسائل الـمحفوظة بسرية وبـدون عـلم الـطرف الأخر\n( `.الذاتية تشغيل` )\n قم بكتابة الامر في أي مكان ليقوم بتفعيل الامر وحفظ الصور الذاتية التدمير تلقائياً\n( `.الذاتية تعطيل` )\n قم بكتابة الامر في مكان لتقوم بتعطيل الامر الصورة الذاتية التدمير\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر التسلية$",
    command=("اوامر التسلية", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"قائمة اوامر التسلية :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.تسلية 1` )\n- ( `.تسلية 2` )\n- ( `.تسلية 3` ) \n- ( `.تسلية 4` )\n- ( `.تسلية 5` )\n- ( `.تسلية 6` )\n- ( `.تسلية 7` )\n- ( `.تسلية 8` ) \n- ( `.فيك typing 300` ) \n- ( `.رفع ادمن` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر التحشيش$",
    command=("اوامر التحشيش", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"قائمة اوامر التحشيش :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n ᯽︙ اختر احدى هذه القوائم\n\n**جميع اوامـر التحشيش تستخـدم بالـرد عـلى الشخص**\n\n- ( `.رفع تاج` )\n- ( `.رفع بكلبي` )\n- ( `.رفع مطي` )\n- ( `.رفع جلب` ) \n- ( `.رفع قرد` )\n- ( `.رفع مرتي` )\n- ( `.رفع زوجي` )\n- ( `.نسبة الانوثة` )\n- ( `.نسبة الحب` )\n- ( `.نسبة الغباء` ) \n- ( `.رفع زاحف` ) \n- ( `.رفع كحبة` ) \n- ( `.رفع فرخ` ) \n- ( `.رزله` ) \n- ( `.رفع صاك` ) \n- ( `.رفع حاته` ) \n- ( `.رفع بقره` ) \n- ( `.رفع ايجة` )\n- ( `.رفع زبال` )\n- ( `.رفع كواد` )\n- ( `.رفع ديوث` )\n- ( `.رفع مجنب` )\n- ( `.رفع مميز` )\n- ( `.رفع ادمن` )\n- ( `.رفع منشئ` )\n- ( `.رفع مالك` )\n- ( `.رفع وصخ` )\n- ( `.نسبة الكذب` )\n- ( `.نسبة الدياثه` )\n- ( `.نسبة الشذوذ` )\n- ( `.نسبة الجمال` )\n- ( `.نسبة الخيانه` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر التحويل$",
    command=("اوامر التحويل", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"شـرح عـن اوامـر تـحويل الصـيغ :\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n ᯽︙ اختر احدى هذه الاوامر\n\n- ( `.تحويل صورة` )\n بالرد على الملصق لتحويله الى صورة\n\n- ( `.تحويل ملصق` )\n بالرد على الصورة لتحويلها الى الملصق\n\n- ( `.تحويل voice` )\nبالرد على مقطع اغنية لتحويله على شكل بصمة صوتية\n\n- ( `.تحويل mp3` )\nبالرد على البصمة الصوتية لتحويلها على شكل  مقطع mp3\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★\n᯽︙ CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الجهات$",
    command=("اوامر الجهات", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الجهات والاضافة\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.ضيف +  رابط مجموعة` )\n  يستخدم الامر لاخذ اعضاء من مجموعة ثانية واضافتهم في مجموعتك ترسل الامر مع اربط قروب عام في مجموعتك للاضافة \n مثال :  .ضيف https://t.me/jepthonSupport \n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الحساب$",
    command=("اوامر الحساب", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الحساب والقنوات والمجموعات التي تديرها\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.معلوماتي` ) \n( `.قائمه قنواتي` ) \n( `.قائمه كروباتي` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)

@l313l.ar_cmd(
    pattern="اوامر الترفيه$",
    command=("اوامر الترفيه", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الترفيه\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.بلي` )\n- ( `.كت` )\n- ( `.خيروك` )\n- ( `.غنيلي` )\n- ( `.شعر` )\n- ( `.قران` )\n- ( `.البنك` )\n- ( `.فلم` )\n- ( `.ثيم` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)

@l313l.ar_cmd(
    pattern="بصمات ميمز$",
    command=("بصمات ميمز", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة بصمات الميمز\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.تخوني` )\n- ( `.مستمرة الكلاوات` )\n- ( `.احب العراق` )\n- ( `.احبك` )\n- ( `.اخت التنيج` )\n- ( `.اذا اكمشك` )\n- ( `.اسكت` )\n- ( `.افتهمنا` )\n- ( `.اكل خرا` )\n- ( `.العراق` )\n- ( `.الكعده وياكم` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)

@l313l.ar_cmd(
    pattern="بصمات ميمز2$",
    command=("بصمات ميمز2", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة بصمات الميمز\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.الكمر اني` )\n- ( `.اللهم لا شماته` )\n- ( `.اني مااكدر` )\n- ( `.بقولك ايه` )\n- ( `.تف على شرفك` )\n- ( `.شجلبت` )\n- ( `.شكد شفت ناس` )\n- ( `.صباح القنادر` )\n- ( `.ضحكة فيطية` )\n- ( `.طار القلب` )\n- ( `.غطيلي` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)

@l313l.ar_cmd(
    pattern="بصمات ميمز3$",
    command=("بصمات ميمز3", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر بصمات الميمز\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.في منتصف الجبهة` )\n- ( `.لاتقتل المتعه` )\n- ( `.لا لتغلط` )\n- ( `.لا يمه لا` )\n- ( `.لحد يحجي وياي` )\n- ( `.ماادري يعني` )\n- ( `.منو انت` )\n- ( `.مو صوجكم` )\n- ( `.خوش تسولف` )\n- ( `.يع` )\n- ( `.زيج` )\n- ( `.زيج2` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)

@l313l.ar_cmd(
    pattern="بصمات ميمز4$",
    command=("بصمات ميمز4", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر بصمات الميمز\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.يعني مااعرف` )\n- ( `.يامرحبا` )\n- ( `.منو انتة` )\n- ( `.ماتستحي` )\n- ( `.كعدت الديوث` )\n- ( `.عيب` )\n- ( `.عنعانم` )\n- ( `.طبك مرض` )\n- ( `.سييي` )\n- ( `.سبيدر مان` )\n- ( `.خاف حرام` )\n- ( `.تحيه لاختك` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)
	
@l313l.ar_cmd(
    pattern="بصمات ميمز5$",
    command=("بصمات ميمز5", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر بصمات الميمز\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.امشي كحبة` )\n- ( `.امداك` )\n- ( `.الحس` )\n- ( `.افتهمنا` )\n- ( `.اطلع برا` )\n- ( `.اخت التنيج` )\n- ( `.اوني تشان` )\n- ( `.اوني تشان2` )\n- ( `.بجيت` )\n- ( `.نشاقة` )\n- ( `.لاتغلط` )\n- ( `.احب الله` )\n- ( `.روح` )\n- ( `.خبز يابس` )\n- ( `.خيار بصل` )\n- ( `.ماي ارو` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
        )
@l313l.ar_cmd(
    pattern="اوامر الفارات",
    command=("اوامر الفارات", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الفارات\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.جلب + اسم الفار` )\n-لجلب قيمة الفار إن وجد\n- ( `.وضع توقيت` )\n-بالرد على المنطقة الزمنية \n- ( `.وضع رمز الاسم` )\n- بالرد على الرمز المراد وضعه \n- ( `.وضع الكروب` )\n- بالرد على اسم الكروب الذي تريد وضعهُ \n- ( `.وضع البايو` )\n- بالرد على النبذا المراد وضعها \n -( `.وضع لون وقتي` )\n- بالرد على اسم اللون بالانجليزي \n- ( `.وضع الصورة` )\n- بالرد على رابط تليجراف الصورة المراد وضعها وكتابة الامر \n- ( `.وضع صورة الكروب` )\n- بالرد على رابط تليجراف الصورة المراد وضعها وكتابة الامر \n- ( `.وضع زخرفة الارقام` )\n- بالرد على الارقام المراد وضعها وكتابة الامر \n- ( `.وضع اسم` )\n- بالرد على الاسم المراد وضعه وكتابة الامر\n- ( `.وضع كروب التخزين` )\n- بالرد على الايدي المحادثة المراد جعلها كروب التخزين \n- ( `.وضع كروب الحفظ` )\n-بالرد على الايدي المحادثة المراد جعلها كروب الحفظ \n- ( `.وقت العراق` )\n- لوضع الساعة بتوقيت العراق \n- ( `.وقت السعودية` )\n - لوضع الساعة بتوقيت السعودية \n- ( `.وقت مصر` )\n -لوضع الساعة بتوقيت مصر \n- ( `.وقت الاردن` )\n- لوضع الساعة بتوقيت الاردن \n- ( `.وقت اليمن` )\n- لوضع الساعة بتوقيت اليمن \n- ( `.وقت سوريا` )\n- لوضع الساعة بتوقيت سوريا\n- تنويه : عندما تريد حذف الفار استعمل الامر (محو) بدل كلمة (وضع)\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)
@l313l.ar_cmd(
    pattern="اوامر الوهمي",
    command=("اوامر الوهمي", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الوهمي\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.كتابة` )\n-مثال : .كتابة + عدد الثواني \n- ( `.صوتية` )\n- مثال : .صوتية + عدد الثواني \n- ( `.فيد` )\n- مثال : .فيد + عدد الثواني \n- ( `.لعبة` )\n- مثال : .لعبة + عدد الثواني\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)
@l313l.ar_cmd(
    pattern="بصمات انمي$",
    command=("بصمات انمي", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر بصمات الانمي\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.انمي1` )\n- ( `.انمي2` )\n- ( `.انمي3` )\n- ( `.انمي4` )\n- ( `.انمي5` )\n- ( `.انمي6` )\n- ( `.انمي7` )\n- ( `.انمي8` )\n- ( `.انمي9` )\n- ( `.انمي10` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"

)
@l313l.ar_cmd(
    pattern="اوامر التجميع$",
    command=("اوامر التجميع", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر التجميع\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.تجميع المليار` )\n- ( `.تجميع الجوكر` )\n- ( `.تجميع العقاب` )\n- ( `.تجميع المليون` )\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر التخصيص$",
    command=("اوامر التخصيص", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر التخصيص\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- قريباً . .\n\n★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="اوامر وعد$",
    command=("اوامر وعد", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "قائمة اوامر وعد\n★•┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉•★➖\n᯽︙ اختر احدى هذه الاوامر\n\n- ( `.راتب وعد` ) :\nعند كتابة الأمر في المجموعة، يقوم البوت بتجميع الأموال كل ١٠ دقيقة.\n\n- ( `.ايقاف راتب وعد` ) :\nيستخدم لإيقاف امر تجميع الراتب من بوت وعد .\n\n- ( `.سرقة وعد + ايدي الشخص` ) :\nيستخدم لسرقة أموال شخص آخر كل ١٠ دقيقة بواسطة إرسال ايدي المستخدم مع الامر .\n\n- ( `.ايقاف سرقة وعد` ) :\nيستخدم لإيقاف امر سرقة الأموال من الآخرين.\n\n- ( `.بخشيش وعد` ) :\nيستخدم لإعطاء بخشيش لك كل ١٠ دقيقة في المجموعة.\n\n- ( `.ايقاف بخشيش وعد` ) :\nيستخدم لإيقاف امر اخذ بخشيش من بوت وعد.\n\n- ( `.استثمار وعد` ) :\nيستخدم لاستثمار أموالك مع كل ٢٠ دقيقة.\n\n- ( `.ايقاف استثمار وعد` ) :\nيستخدم لإيقاف عملية الاستثمار بأموالك.\n\n★•┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉•★➖\n⌔︙CH : @jepthon"
)
@l313l.ar_cmd(
    pattern="الميمز$",
    command=("الميمز", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"الميمز المضاف تلقائيا ... \n  `.لتغلط` \n `.ببجي` \n `.نشاقة` \n `.احب الله` \n `.هع` \n `.تف`  \n `.شش`  \n `.ماذا`  \n `.هه`  \n `.نية`  \n `.مرهم` \n `.سبحان` \n `.طط` \n `.لاا` \n `.زيج2` \n `.زيج` \n `.عبود` \n `.نيو` \n `.هههه` \n `.انجب` \n `.امريكا` \n `.شسوي` \n `.ها` \n `.مي` \n `.انعل` \n `.فلا` \n `.طاح` \n `.شماته` \n `.ماكدر` \n `.لب` \n `.خوش` \n `.صل` \n `.ط` \n `.يولن` \n `.ههه` \n `.كعبة` \n `.شبيك` \n `.دكي` \n `.نعال` \n `.دنجب` \n `.روح` \n `.مزنجر` \n `.الهي` \n `.ملحد` \n `.يدكتور` \n `.ميم` \n `.اي` \n `.يامرحبا` \n `.نوكيا` \n `.بوربه` \n `.طبك` \n `.اطلع`")
	    
@l313l.ar_cmd(
    pattern="حاجاتي$",
    command=("حاجاتي", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
		"1-[ مجموعتي](t.me/V2V5V) \n 2-[حَـافـر](t.me/x04ou) \n 3-[channel](t.me/sszxl) \n 4-[مستفهم](t.me/EHIEX) \n 5-[موؤل](t.me/iamMUAOL) \n ENJOY وردة"
	)
	     	    
@l313l.ar_cmd(
    pattern="الجديد$",
    command=("الجديد", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"الاوامر الحديثة او المستحدثه \n التاريخ 2024/11/7 \n 1- اوامر التقييد والحظر اصبحت ب صور مختلفة \n 2- اوامر التثبيت هي `.تثبيت` او `.ت` \n 3-ل الغاء التثبيت استخدم `.الغاء التثبيت` او `.تت` \n 4- ميزة مخفية وهي `.خاص` تقوم ب ارسال الرسالةالئ الخاص \n 5- اوامر الذاتية بعد ان تم حذفها في المجاني `.الذاتية تشغيل` \n 6- `.رسالة` بالرد او بوضع منشن مع كلام ل ارساله \n 7- اوامر الميمز , اكتب `.الميمز`  \n 8- امر ما مطروق يرسلك لطمية عشوائية , اكتب `.لطمية` \n  9-`.ع` \n امر يخليك ترد السلام علئ الشخص \n 10- اوامر \n `.رجب` \n `.شعبان` \n `.رمضان` \n `.محرم` \n يحسبلك كم يوم باقي علئ هذا الشهر الي مذكور اسمه \n استمتع ")

	     	    
@l313l.ar_cmd(
    pattern="ع$",
    command=("ع", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"عليكم السلام ورحمه الله"
	)
	     	    
@l313l.ar_cmd(
    pattern="بوتاتي$",
    command=("بوتاتي", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"البوتات \n @TT_TABOT \n \n @GAMES_ABHBOT"
	)
	     	    
@l313l.ar_cmd(
    pattern="الامام العباس$",
    command=("الامام العباس", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"سَلامُ اللهِ وَسَلامُ مَلائِكَتِهِ الْمُقَرَّبِينَ وَأَنْبِيَائِهِ الْمُرْسَلِينَ ، وَعِبَادِهِ الصَّالِحِينَ وَجَمِيعِ الشُّهَداءِ وَالصِّدِّيقِينَ ، وَالزَّاكِيَاتُ الطَّيِّبَاتُ فِيمَا تَغْتَدِي وَتَرُوحُ عَلَيْكَ يَابْنَ أَمِيرِ الْمُؤْمِنِينَ ، أَشْهَدُ لَكَ بِالتَّسْلِيمِ وَالتَّصْدِيقِ وَالْوَفَاءِ وَالنَّصِيحَةِ ، لِخَلَفِ النَّبِيِّ الْمُرْسَلِ ـ صَلَّى اللهُ عَلَيْهِ وَآلِهِ ـ ، وَالسِّبْطِ الْمُنْتَجَبِ ، وَالدَّلِيلِ الْعَالِمِ ، وَالْوَصِيِّ الْمُبَلِّغِ ، وَالْمَظْلُومِ الْمُهْتَضَمِ ، فَجَزَاكَ اللهُ عَن رَّسُولِهِ وَعَنْ أَمِيرِ الْمُؤْمِنينَ وَعَنْ فَاطِمَةَ والْحَسَنِ وَالْحُسَيْنِ ـ صَلَوَاتُ اللهِ عَلَيْهِمْ ـ أَفْضَلَ الْجَزاءِ ، بِمَا صَبَرْتَ وَاحْتَسَبْتَ وَأَعَنْتَ ، فَنِعْمَ عُقْبَى الدَّارِ ، لَعَنَ اللهُ مَنْ قَتَلَكَ ، وَلَعَنَ اللهُ مَنْ جَهِلَ حَقَّكَ وَاسْتَخَفَّ بِحُرْمَتِكَ ، وَلَعَنَ اللهُ مَنْ حَالَ بَيْنَكَ وَبَيْنَ مَاءِ الْفُرَاتِ ، أَشْهَدُ أَنَّكَ قُتِلْتَ مَظْلُوماً ، وَأَنَّ اللهَ مُنْجِزٌ لَّكُم مَّا وَعَدَكُمْ ، جِئْتُكَ يَابْنَ أَمِيرِ اْلُمْؤْمِنينَ وَافِداً إِلَيْكُمْ ، وَقَلْبِي مُسَلِّمٌ لَّكُمْ وَتابِعٌ ، وَأَنَا لَكُمْ تَابِعٌ وَنُصْرَتِي لَكُم مُّعَدَّةٌ ، حَتّى يَحْكُمَ اللهُ وَهُوَ خَيْرُ الْحَاكِمِينَ ، فَمَعَكُمْ مَعَكُمْ لا مَعَ عَدُوِّكُمْ ، إِنِّي بِكُمْ وَبِإِيَابِكُمْ مِنَ الْمُؤْمِنينَ ، وَبِمَنْ خَالَفَكُمْ وَقَتَلَكُمْ مِنَ الْكَافَرِينَ ، قَتَلَ اللهُ أُمَّةً قَتَلَتْكُمْ بِالأَيْدِي وَالأَلْسُنِ . ثمّ ادخل فانكبّ على القبر وقلْ : اَلسَّلامُ عَلَيْكَ أَيُّهَا الْعَبْدُ الصَّالِحُ الْمُطِيعُ للهِ وَلِرَسُولِهِ وَلِأَميرِ الْمُؤْمِنينَ وَالْحَسَنِ والْحُسَيْنِ ـ صَلَّى اللهُ عَلَيْهِمْ وَسَلَّمَ ـ ، اَلسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ ، وَمَغْفِرَتُهُ وَرِضْوَانُهُ وَعَلَى رُوحِكَ وَبَدَنِكَ ، أَشْهَدُ ـ وأُشْهِدُ اللهَ ـ أَنَّكَ مَضَيْتَ عَلَى مَا مَضَى بِهِ الْبَدْرِيُّونَ وَالْمُجَاهِدُونَ فِي سَبيلِ اللهِ الْمُنَاصِحُونَ لَهُ فِي جِهَادِ أَعْدَائِهِ ، الْمُبَالِغُونَ فِي نُصْرَةِ أَوْلِيَائِهِ ، الذَّابُّونَ عَنْ أَحِبَّائِهِ ، فَجَزاكَ اللهُ أَفْضَلَ الْجَزاءِ ، وَأَكْثَرَ الْجَزاءِ ، وَأَوْفَرَ الْجَزَاءِ ، وَأَوْفَى جَزاءِ أَحَدٍ مِمَّن وَّفَى بِبَيْعَتِهِ ، وَاسْتَجابَ لَهُ دَعْوَتَهُ ، وَأَطَاعَ وُلاةَ أَمْرِهِ ، أَشْهَدُ أَنَّكَ قَدْ بَالَغْتَ فِي النَّصِيحَةِ وَأَعْطَيْتَ غايَةَ الْمَجْهُودِ ، فَبَعَثَكَ اللهُ فِي الشُّهَداءِ ، وَجَعَلَ رُوحَكَ مَعَ أَرْوَاحِ السُّعَداءِ ، وَأَعْطَاكَ مِنْ جِنَانِهِ أَفْسَحَهَا مَنْزِلاً وَّأَفْضَلَهَا غُرَفاً ، وَّرَفَعَ ذِكْرَكَ فِي عِلِّيِّينَ ، وَحَشَرَكَ مَعَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَداءِ وَالصَّالِحِينَ ، وَحَسُنَ أُولَئِكَ رَفِيقاً ، أَشْهَدُ أَنَّكَ لَمْ تَهِن وَّلَمْ تَنْكُلْ ، وَأَنَّكَ مَضَيْتَ عَلَى بَصِيرَةٍ مِنْ أَمْرِكَ مُقْتَدِياً بِالصَّالِحِينَ ، وَمُتَّبِعاً لِّلنَّبِيِّينَ ، فَجَمَعَ اللهُ بَيْنَنَا وَبَيْنَكَ وَبَيْنَ رَسُولِهِ وَأَوْلِيَائِهِ فِي مَنَازِلِ الْمُخْبِتِينَ ، فَإِنَّهُ أَرْحَمُ الرَّاحِمِينَ . ثمّ صرْ إلى الرأس الشريف وصلّ ركعتين وادعُ بهذا الدعاء : اَللَّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَّآلِ مُحَمَّدٍ ، وَّلا تَدَعْ لِي فِي هذَا الْمَكَانِ الْمُكَرَّمِ وَالْمَشْهَدِ الْمُعَظَّمِ ذَنْباً إِلَّا غَفَرْتَهُ ، وَلا هَمًّا إِلَّا فَرَّجَتَهُ ، وَلا مَرَضاً إِلَّا شَفَيْتَهُ ، وَلا عَيْباً إِلَّا سَتَرْتَهُ ، وَلا رِزْقاً إِلَّا بَسَطتَّهُ ، وَلا خَوْفاً إِلَّا آمَنْتَهُ ، وَلا شَمْلاً إِلَّا جَمَعْتَهُ ، وَلا غائِباً إِلَّا حَفِظْتَهُ وَأَدْنَيْتَهُ ، وَلا حَاجَةً مِّنْ حَوَائِجِ الدُّنْيَا وَالْآخِرَةِ لَكَ فِيهَا رِضًى وَلِيَ فِيهَا صَلاحٌ إِلَّا قَضَيْتَها يَا أَرْحَمَ الرَّاحِمِينَ . ثمّ عُدْ إلى جهة الرّجلَيْن وقُلْ : اَلسَّلامُ عَلَيْكَ يَا أَبَا الْفَضْلِ الْعَبَّاسَ بْنَ أَمِيرِ الْمُؤْمِنينَ ، اَلسَّلامُ عَلَيْكَ يَابْنَ سَيِّدِ الْوَصِيِّينَ ، اَلسَّلامُ عَلَيْكَ يَابْنَ أَوَّلِ الْقَوْمِ إِسْلاماً ، وَّأَقْدَمِهِمْ إِيْمَاناً وَّأَقْوَمِهِمْ بِدِينِ اللهِ ، وَأَحْوَطِهِمْ عَلَى الإِسْلامِ ، أَشْهَدُ لَقَدْ نَصَحْتَ للهِ وَلِرَسُولِهِ وَلِأَخيكَ ، فَنِعْمَ الأَخُ الْمُواسي ، فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ ، وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ ، وَلَعَنَ اللهُ أُمَّةً اسْتَحَلَّتْ مِنْكَ الْمَحَارِمَ ، وَانْتَهَكَتْ حُرْمَةَ الإِسْلامِ ، فَنِعْمَ الصَّابِرُ الْمُجَاهِدُ الْمُحَامِي النَّاصِرُ ، وَالأَخُ الدَّافِعُ عَنْ أَخِيهِ ، الْمُجيبُ إِلَى طَاعَةِ رَبِّهِ ، الرَّاغِبُ فِيمَا زَهِدَ فِيهِ غَيْرُهُ مِنَ الثَّوَابِ الْجَزِيلِ وَالثَّنَاءِ الْجَمِيلِ ، وَأَلْحَقَكَ اللهُ بِدَرَجَةِ آبَائِكَ فِي جَنَّاتِ النَّعِيمِ ، اَللَّـهُمَّ إِنِّي تَعَرَّضْتُ لِزِيَارَةِ أَوْلِيَائِكَ رَغْبَةً فِي ثَوَابِكَ ، وَرَجَاءً لِّمَغْفِرَتِكَ وَجَزيلِ إِحْسَانِكَ ، فَأَسْأَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَّآلِهِ الطَّاهِرِينَ ، وَأَنْ تَجْعَلَ رِزْقِي بِهِمْ دَارًّا ، وَّعَيْشِي بِهِمْ قَارًّا ، وَّزِيَارَتِي بِهِمْ مَقْبُولَةً ، وَّحَيَاتِي بِهِمْ طَيِّبَةً ، وَّأَدْرِجْنِي إِدْرَاجَ الْمُكْرَمِينَ ، وَاجْعَلْنِي مِمَّن يَّنْقَلِبُ مِنْ زِيَارَةِ مَشَاهِدِ أَحِبَّائِكَ مُفْلِحاً مُّنْجِحاً ، قَدِ اسْتَوْجَبَ غُفْرَانَ الذُّنُوبِ وَسَتْرَ الْعُيُوبِ وَكَشْفَ الْكُرُوبِ ، إِنَّكَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ ."
	)
	     	    
@l313l.ar_cmd(
    pattern="مناجاة$",
    command=("مناجاة", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
"بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ : إِلَهِي أَلْبَسَتْنِي الْخَطَايَا ثَوْبَ مَذَلَّتِي ، وَجَلَّلَنِي التَّبَاعُدُ مِنْكَ لِباسَ مَسْكَنَتِي ، وَأَمَاتَ قَلْبِي عَظِيمُ جِنَايَتِي ، فَأَحْيِهِ بِتَوْبَةٍ مِّنْكَ يَا أَمَلِي وَبُغْيَتِي وَيَا سُؤْلِي وَمُنْيَتِي ، فَوَعِزَّتِكَ مَا أَجِدُ لِذُنُوبِي سِوَاكَ غَافِراً ، وَلا أَرَى لِكَسْرِي غَيْرَكَ جَابِراً ، وَقَدْ خَضَعْتُ بِالإِنَابَةِ إِلَيْكَ وَعَنَوْتُ بِالِاسْتِكانَةِ لَدَيْكَ ، فَإِنْ طَرَدْتَنِي مِنْ بَابِكَ فَبِمَنْ أَلُوذُ ؟ وَإِن رَّدَدْتَنِي عَنْ جَنَابِكَ فَبِمَنْ أعُوذُ ؟ فَوا أَسَفَاهُ مِنْ خَجْلَتِي وَافْتِضَاحِي ، وَوَا لَهْفَاهُ مِنْ سُوءِ عَمَلِي وَاجْتِرَاحِي ، أَسْأَلُكَ ـ يَا غَافِرَ الذَّنْبِ الكَبِيرِ ، وَيَا جابِرَ الْعَظْمِ الْكَسِيرِ ـ أَنْ تَهَبَ لِي مُوبِقَِاتِ الْجَرَائِرِ ، وَتَسْتُرَ عَلَيَّ فَاضِحَاتِ السَّرَائِرِ ، وَلا تُخْلِنِي فِي مَشْهَدِ الْقِيَامَةِ مِنْ بَرْدِ عَفْوِكَ وَغَفْرِكَ ، وَلا تُعْرِنِي مِنْ جَمِيلِ صَفْحِكَ وَسَتْرِكَ ، إِلَهِي ظَلِّلْ عَلَى ذُنُوبِي غَمَامَ رَحْمَتِكَ ، وَأَرْسِلْ عَلَى عُيُوبِي سَحَابَ رَأْفَتِكَ ، إِلَهِي هَلْ يَرْجِعُ الْعَبْدُ الآبِقُ إِلَّا إِلَى مَوْلَاهُ ؟ أَمْ هَلْ يُجِيرُهُ مِنْ سَخَطِهِ أَحَدٌ سِوَاهُ ؟ إِلَهِي إِنْ كَانَ النَّدَمُ عَلَى الذَّنْبِ تَوْبَةً فَإِنِّي وَعِزَّتِكَ مِنَ النَّادِمِينَ ! وَإِنْ كَانَ الِاسْتِغْفَارُ مِنَ الْخَطِيئَةِ حِطَّةً فَإنِّي لَكَ مِنَ المُسْتَغْفِرِينَ ! لَكَ الْعُتْبَى حَتَّى تَرْضَى ، إِلَهِي بِقُدْرَتِكَ عَلَيَّ تُبْ عَلَيَّ ، وَبِحِلْمِكَ عَنِّي اعْفُ عَنِّي ، وَبِعِلْمِكَ بِي ارْفَـُقْ بِي ، إِلَهِي أَنْتَ الَّذِي فَتَحْتَ لِعِبَادِكَ بَاباً إِلَى عَفْوِكَ سَمَّيْتَهُ التَّوْبَةَ ، فَقُلْتَ : (( تُوبُوا إِلَى اللهِ تَوْبَةً نَصُوحاً )) ، فَمَا عُذْرُ مَنْ أَغْفَلَ دُخُولَ الْبَابِ بَعْدَ فَتْحِهِ ؟ إِلَهِي إنْ كَانَ قَبُحَ الذَّنْبُ مِنْ عَبْدِكَ فَلْيَحْسُنِ الْعَفْوُ مِنْ عِنْدِكَ ، إِلهِي مَا أَنَا بِأَوَّلِ مَنْ عَصَاكَ فَتُبْتَ عَلَيْهِ ، وَتَعَرَّضَ لِمَعْرُوفِكَ فَجُدتَّ عَلَيْهِ ، يَا مُجِيبَ الْمُضْطَرِّ ، يَا كَاشِفَ الضُّرِّ ، يا عَظِيمَ الْبِرِّ ، يَا عَلِيماً بِمَا فِي السِّرِّ ، يا جَمِيلَ السَِّتْرِ ، اِسْتَشْفَعْتُ بِجُودِكَ وَكَرمِكَ إِلَيْكَ ، وَتَوَسَّلْتُ بِجَنَابِكَ وَتَرَحُّمِكَ لَدَيْكَ ، فَاسْتَجِبْ دُعَائِي وَلا تُخَيِّبْ فِيكَ رَجَائِي ، وَتَقَبَّلْ تَوْبَتِي وَكَفِّرْ خَطِيئَتِي ، بِمَنِّكَ وَرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ."	)

